blog-posts/2005-09-02-waaaaaaaaaaaaaaaaaaahoooooooooooo-published.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Waaaaaaaaaaaaaaaaaaahoooooooooooo! Published!</title>
<!-- 2015-10-19 Mon 14:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Waaaaaaaaaaaaaaaaaaahoooooooooooo! Published!</h1>
<p>
September 2nd, 2005 -
<a href="http://sachachua.com/blog/p/2949"><a href="http://sachachua.com/blog/p/2949">http://sachachua.com/blog/p/2949</a></a>
</p>

<p>
Bob Erb wrote:
</p>

<blockquote>
<p>
Reading Linux Journal at work today, I get to the article
 about todo lists, browsing through it, getting interested when it
 started talking about plain text files, then excited when
planner-mode
 was mentioned, then thinking, “I'll have to tell emacs-wiki-discuss
 about this!” as the discussion of planner-mode continued, then, wow,
 it's you!
</p>
</blockquote>

<p>
Waaaaaaaaaaaaaaaaaahooooooooooooooooo! I've been published!
 My article on <a href="http://www.linuxjournal.com/article/8378">Taming the
TODO</a> came out in
 <a href="http://www.linuxjournal.com/issue/138">Linux Journal #138, October
2005</a>. Buy a copy!
</p>

<p>
Thanks in no small part to Travis Hartwell (who poked me into actually
 \<sub>doing\</sub>_ something that had been on my TODO list for ages), Dominique
 Cimafranca (who helped me fix my absolutely horrible first draft),
 Jill Franklin and Don Marti of Linux Journal, and of course the
 absolutely wonderful Planner community&#x2026;
</p>

<p>
Happy happy joy joy! Happy happy joy joy!
</p>

<p>
E-Mail from Bob Erb
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
